app/controllers/api/auth_controller.rb

INSERT INTO "users" ("workspace_id", "name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "workspaces" ("name", "business_type", "plan", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Demo Workspace"], ["business_type", nil], ["plan", "Growth"], ["created_at", "2026-05-02 12:30:45.622203"], ["updated_at", "2026-05-02 12:30:45.622203"]]
---
    def signup
      workspace = Workspace.new(name: params[:workspace_name].presence || "#{params[:name]}'s Company", business_type: params[:business_type], plan: "Growth")
      user = workspace.users.build(name: params[:name], email: params[:email], password: params[:password], role: "owner")

      ActiveRecord::Base.transaction do
        workspace.save!

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]
---
    def login
      user = User.find_by(email: params[:email].to_s.downcase)