app/controllers/api/team_controller.rb

    def index
      render json: { team: current_workspace.users.order(:role, :name).map { |user| serialize_user(user) } }
---
SELECT "users".* FROM "users" WHERE "users"."workspace_id" = $1 ORDER BY "users"."role" ASC, "users"."name" ASC  [["workspace_id", 2]]