app/controllers/application_controller.rb

  def authenticate_user!
    header = request.headers["Authorization"].to_s
    token = header.split.last
    payload = JsonWebToken.decode(token)
    @current_user = User.includes(:workspace).find(payload["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1  [["id", 2]]